Documents/ОплатаПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОплатаПроживания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетОплатыПроживания</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СотрудникЗаполняющийДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйТипОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФинансовыйТипОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ОплатаОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбразовательнаяОрганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбразовательныеОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Общежитие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПроживания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборХарактеристик</Name>
							<Comment>Набор характеристик</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикаСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОплатаПроживания/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОплатаПроживания.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаПроживания.Дата,
	|	ОплатаПроживания.Номер,
	|	ОплатаПроживания.СотрудникЗаполняющийДокумент,
	|	ОплатаПроживания.СуммаДокумента,
	|	ОплатаПроживания.ТипОплаты,
	|	ОплатаПроживания.ФинансовыйТипОбучения,
	|	ОплатаПроживания.ТЧ_ОплатаОбучения.(
	|		НомерСтроки,
	|		Студент,
	|		ОбразовательнаяОрганизация,
	|		Общежитие,
	|		ОплатаПроживания
	|	)
	|ИЗ
	|	Документ.ОплатаПроживания КАК ОплатаПроживания
	|ГДЕ
	|	ОплатаПроживания.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ОплатаОбученияШапка = Макет.ПолучитьОбласть("ТЧ_ОплатаОбученияШапка");
	ОбластьТЧ_ОплатаОбучения = Макет.ПолучитьОбласть("ТЧ_ОплатаОбучения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ОплатаОбученияШапка);
		ВыборкаТЧ_ОплатаОбучения = Выборка.ТЧ_ОплатаОбучения.Выбрать();
		Пока ВыборкаТЧ_ОплатаОбучения.Следующий() Цикл
			ОбластьТЧ_ОплатаОбучения.Параметры.Заполнить(ВыборкаТЧ_ОплатаОбучения);
			ТабДок.Вывести(ОбластьТЧ_ОплатаОбучения, ВыборкаТЧ_ОплатаОбучения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
